{
  "main": {
    "name": "Cody Ferguson",
    "occupation": "Software Engineer",
    "description": "I currently work at Kohl's on the Planning Engineering team building internal web applications.",
    "image": "me_vacation.jpg",
    "bio": "Growing up, I always wanted to be an Engineer. Combined with my interest in computers, I pursued becoming a Software Engineer at The Univeristy of Wisconsin - Platteville. I currently work on web based applications at Kohl's. I enjoy experimenting with new technology and hobby game development while I am not working on DIY projects for my home.",
    "email": "cody.h.ferguson@gmail.com",
    "phone": "(608)-290-3830",
    "address": {
      "city": "Milwaukee",
      "state": "Wisconsin"
    },
    "website": "http://www.codyferguson.net",
    "resumedownload": "CodyFergusonResume2021.pdf",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/cody-ferguson-8aa18b109/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "http://github.com/codyferguson",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I love to learn new tech stacks, and experirement with different areas of software development. Here are some of the technologies I am most familiar with.",
    "education": [
      {
        "school": "University of Wisconsin - Platteville",
        "degree": "Bachelors of Science Software Engineering",
        "graduated": "May 2017",
        "description": "A focus on hands on learning with projects using Java, C#, C++, and C. Alongside coding, software engineering classes demonstrated the steps of the software development life cycle."
      }
    ],
    "work": [
      {
        "company": "Kohls",
        "title": "Software Engineer",
        "years": "April 2020 - Present",
        "description": "I continued worked on the Planning tool where we developed functionality to reference 2 year old data rather than the built in last year data so that Planners can avoid referencing low numbers from 2020. Also, after working with the business analyst on user's needs for a corporate level of reporting on programs, we determined that instead of developing seperate functionality, our current rollup component could be extended. This set us up perfectly for our transition from Github and Jenkins to Gitlab and Gitlab's auto DevOps. I helped convert our current applications to work with Gitlab's auto DevOps features which created many hurdles that lead to an opportunity to expand my knowledge of DevOps in practice."
      },
      {
        "company": "Kohls",
        "title": "Associate Software Engineer",
        "years": "January 2018 - April 2020",
        "description": "After the Great Start rotational program, I was assigned to the Merchandising Service Delivery team where I developed applications to help my co workers support Merchandising applications. Then I moved to the Merchandising Engineering team where I began working on an internal planning software. I started by implementing improvements to buy worksheets functionality. I was then moved to the program planning where we designed new functionality around planning many programs under one planner which greatly increased their productivity. I took this time to refactor code from the Angular components to reuse for bulk actions which decoupled the logic into a service file. I also lead the conversion of our batch job orchestration from running on a mainframe to using Airflow which aligned with Kohl's move off the mainframe."
      },
      {
        "company": "Kohls",
        "title": "Associate Software Engineer - Great Start",
        "years": "June 2017 - January 2018",
        "description": "I started at Kohl's on a rotational program where I first helped the Omni-channel Fulfilment team in developing a tool to check the discrepancies between two internal inventory systems. Then, I assisted the Merchandise Service Delivery team by developing applications that improved my co-workers ability to support Merchandising applications. I was quickly exposed to enterprise projects, and learned a great amount during the rotation"
      }
      ,
      {
        "company": "Kohls",
        "title": "Software Engineer Intern",
        "years": "Summer 2016",
        "description": "I designed and implemented improvements to ServiceNow pages. Also, I participated in a Shark Tank like intern presentation on an innovative idea presented to Kohl's upper management. This was great exposure to working with a diverse team to drive innovation, and present to the CTO."
      }
      ,
      {
        "company": "LasX",
        "title": "Software Engineer Intern",
        "years": "Summer 2015",
        "description": "I developed automated tests for LightGuide, an in-house software, using Telerik's Test Studio. Created manual tests for LightGuide running on a research and develoment laser. While developing the manual tests, and trying to find good designs for test cases, I uncovered a hard to find edge case which helped the senior developers find the underlying issue."
      }
    ],
    "techs": [
      {
        "name": "Java",
        "image": "java.jpg",
        "description": "I have used Java from my time at Platteville to most of my projects at Kohl's. I still have plenty to learn, but I am most comfortable using Java particularly with Spring and Maven to create a back end API. "
      },
      {
        "name": "Spring",
        "image": "spring.png",
        "description": "Most of my projects at Kohl's have been using Java and Spring Framework. I have worked on Spring Batch and Spring Rest. I usually look for tasks at work on the backend to expand my knowledge of the Spring Framework."
      },
      {
        "name": "MongoDB",
        "image": "mongo.jpg",
        "description": "On all my projects that I have worked on with at Kohl's, we have used MongoDB. I have developed queries to aggregate different collections to get KPIs on application usage. I would like to learn more about indexing and how to use it to speed up common queries."
      },
      {
        "name": "C#",
        "image": "cSharp.png",
        "description": "I have worked with C# as a scripting language when creating games using Unity. From there, I have been using C# to practice coding problems with the plan to expand my knowledge further by doing a todo application using C# and the .NET framework for the backend."
      },
      {
        "name": "Python",
        "image": "python.png",
        "description": "I have used Python for many small projects like querying MongoDB to retrieve KPIs in csv format for our business analyst to better understand what users are actually doing in the application. Also, I worekd with Python when writing DAGs in Airflow which I used to schedule an API call to Spring Batch jobs."
      },
      {
        "name": "React",
        "image": "react.jpg",
        "description": "For now, my experience with react has been smaller projects in my free time. I hope to get more experience with React by doing these small projects, like this website."
      }
    ]
  }
}
